# FabricationService Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService Class
Members See Also
---
This object contains information about a fabrication service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationService : IDisposable
```

Visual Basic
---
```text
Public Class FabricationService _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationService : IDisposable
```

# Remarks
A fabrication service defines what fabrication service buttons that can be used. Fabrication services are part of the fabrication configuration.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FabricationService
# See Also
FabricationService Members
Autodesk.Revit.DB Namespace